# GetAreaVolumeSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaVolumeSettings..::..GetAreaVolumeSettings Method
AreaVolumeSettings Class See Also
---
Get the area and volume settings of the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static AreaVolumeSettings GetAreaVolumeSettings(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function GetAreaVolumeSettings ( _
	aDoc As Document _
) As AreaVolumeSettings
```

Visual C++
---
```text
public:
static AreaVolumeSettings^ GetAreaVolumeSettings(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The area and volume settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace